[
	{
		"_id": "551a572201026403007ead86",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2662916154-jpg/img/headshots/AdrianTeodorescu.jpg?t=1427483970646",
		"name": "Adrian Teodorescu  ",
		"title": "Senior Software Engineer",
		"company": "Sencha",
		"bio": "Adrian has more than 15 years experience in the IT industry as both sa oftware developer and consultant. Since 2009, he has been active in the Sencha community and developed various applications and components using Ext JS and Sencha Touch. Following the acquisition of his mzPivotGrid component by Sencha, Adrian decided to join the Sencha team.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd2060fc1100300fcf1e0",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511557171-jpg/img/headshots/AlexTokarev.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Alex Tokarev",
		"bio": "Alex Tokarev is a veteran engineer and systems architect. Having built several of the largest enterprise call centers in Russia, Alex was considered one of the top experts in his field when he decided to seek new challenges and switched to software engineering. Alex has founded a software startup, learned how to hack in Perl and JavaScript and immigrated to the USA. Believing that Ext JS can be made even more awesome, Alex joined Sencha in 2012 and has been busy cranking out features and squashing bugs ever since. Alex dwells among the redwoods in Northern California, and when not working he can be found hiking in the forests, obsessing over pictures in his photo lab, or playing with his two sons.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Software Engineer"
	},
	{
		"_id": "54fdd20412b592030001d4f4",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2572841125-jpg/img/headshots/AndrewDuncan.jpg?t=1425695939615",
		"name": "Andrew Duncan ",
		"bio": "Andrew has combined a passion for IT with a strong aptitude for business to create SwarmOnline - one of Scotland’s fastest growing tech companies. Three years ago he founded SwarmOnline who became Sencha’s first partner outside of the U.S. Since then Andrew has grown the business year on year and acknowledges that Sencha has had a huge impact on his success. Although Andrew is a Managing Director, he is also an experienced and highly competent technologist and solutions architect. He has co-written Ext JS 4 Web Application Development Cookbook and is currently busy writing another two Ext JS books, due out soon. Last year Andrew’s success was recognized when he received a nomination for Young Business Person of the Year at the prestigious Glasgow Business Awards. Andrew is a sought after conference speaker. Previous speaking engagements include SenchaCon 2013 in Florida, Citi Group HTML5 Developer Conference in Dublin and ModUXCon in Amsterdam.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "SwarmOnline",
		"title": "Managing Director"
	},
	{
		"_id": "54fdd20612b592030001d4fd",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2532111804-jpg/img/headshots/ArtLandro.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Art Landro",
		"bio": "Art Landro brings 25 years of global business experience to Sencha. Prior to Sencha, Art was CEO of Cordys, where he transformed the Netherlands-based software company into a BPM PaaS and Cloud Provisioning provider and successfully led its acquisition by OpenText. His record of driving sales started before that, when he was President of MontaVista Software, breaking into non-traditional Linux markets from automotive infotainment systems to aerospace controls. Art served five years of Active Duty in the U.S. Air Force and 22 years in the Air Force Reserves, retiring as a Lieutenant Colonel.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "CEO"
	},
	{
		"_id": "54fdd20612b592030001d4fc",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2527770365-jpg/img/headshots/ArtKay.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Arthur Kay",
		"bio": "Arthur Kay has been working with the Web since the late 1990s, when GeoCities and scrolling marquees were all the rage. Since those early days, Arthur graduated from Loyola University Chicago (where he studied Music and Computer Science) and has worked in a variety of professional roles throughout the Internet industry. Arthur currently lives in the Chicago suburbs and works as Developer Relations Manager for Sencha, Inc.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Developer Relations Manager"
	},
	{
		"_id": "54fdd2040fc1100300fcf1d8",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2557678828-jpg/img/headshots/BenjaminMestrallet.jpg?t=1425695939615",
		"name": "Benjamin Mestrallet",
		"bio": "Benjamin Mestrallet is the CEO of eXo, a company he founded just out of university to serve its first customer, the U.S. Department of Defense. With eXo's recent expansion to North America, Benjamin now oversees the Company's growth, marketing and sales strategy from San Francisco. He first created the eXo project while a student and, in December 2002, delivered the industry's first Java portlet container. Under Benjamin's leadership, eXo has expanded globally with operations in five countries and its product line to be the most comprehensive portfolio of open source collaboration software on the market. In recognition of his leadership and business savvy, a jury of France's top technology executives honored Benjamin as 2008's most outstanding young technology leader with the IVY Award. He holds an advanced master's degree in management science from the University of Paris IX, Dauphine.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "eXo",
		"title": "Founder and CEO"
	},
	{
		"_id": "54fdd2040fc1100300fcf1d7",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511557166-jpg/img/headshots/BobSpencer.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Bob Spencer",
		"bio": "Bob Spencer is a Senior Software engineer at Intel where he has worked for the past 15 years on a variety of projects from system management, interactive television, and high availability clusters. For the past six years he has worked in Intel’s Open Source Technology Center focusing on developer tools for mobile and embedded systems. He is currently the Crosswalk Project community manager.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Intel",
		"title": "Senior Software Engineer"
	},
	{
		"_id": "551e340b9f8dd30300848591",
		"avatar_url": "http://cdn2.hubspot.net/hubfs/439787/img/headshots/BrandonDonnelson.jpg?t=1428481721250",
		"name": "Brandon Donnelson",
		"title": "Support Engineer",
		"company": "Sencha",
		"bio": "Brandon is a GXT Support Engineer with Sencha and has over 10 years of experience in web app development. He specializes in web, Java, and GWT apps as well as developing IDE plugins and writing documentation. Brandon enjoys helping people develop web applications that improve their lives.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd2040fc1100300fcf1d6",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689654-jpg/img/headshots/ChristianTaltas.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Christian Taltas",
		"bio": "Christian Taltas, a Web Applications Architect with 17 years of expertise, has always been an entrepreneur and, as seen by his peers, a “man of vision, strategy and action”. He is also considered as an expert in Node.js and has spent the last 3 years in developing his new framework based on Node.js and Sencha Ext JS 5.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "KPMG",
		"title": "Managing Director"
	},
	{
		"_id": "551a576101026403007ead87",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2662911089-jpg/img/headshots/DanielGallo.jpg?t=1427483970646",
		"name": "Daniel Gallo",
		"title": "Sales Engineer",
		"company": "Sencha",
		"bio": "Dan joined Sencha in early 2012 and currently works as a Sales Engineer based out of Sencha’s headquarters in Redwood City, California. He has over 9 years experience developing innovative web-based applications using a variety of technologies, and specializes in ASP.NET C# and JavaScript.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd2060fc1100300fcf1df",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562176-jpg/img/headshots/DavidChandler.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "David Chandler",
		"bio": "David fell in love with programming at age 14 on his TI-99/4A, studied electrical engineering at the University of Kansas, and soon after wrote the first published book on Web servers (Running a Perfect Web Site, 1995). He has worked on software for everything from airborne GPS receivers to Internet banking and has written Web applications in everything from C to ColdFusion to JSF and most recently GWT. As a Developer Advocate with Google for 3.5 years, Chandler supported the worldwide GWT and Android communities through blogging, open source projects, and conference speaking. He actively contributes to open source projects (github: turbomanage) and blogs about Java Web and mobile development at turbomanage.wordpress.com. Chandler lives in Colorado with his family and enjoys photography, hiking in Rocky Mountain National Park, skiing, piano, and teaching math and Java to high school students every now and then.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Senior Developer Advocate"
	},
	{
		"_id": "54fdd20612b592030001d4fb",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562181-jpg/img/headshots/DonGriffin.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Don Griffin",
		"bio": "Don Griffin is the engineering manager for Ext JS and Sencha Touch. He was an Ext JS user for 2 years before joining Sencha and has over 20 years of software engineering experience on a broad range of platforms. His experience includes designing web application front-ends and back-ends, native GUI applications, network protocols and device drivers. Don’s passion is to build world class products that people love to use.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Engineering Manager"
	},
	{
		"_id": "54fdd20412b592030001d4f3",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689659-jpg/img/headshots/DougBieber.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Douglas Bieber",
		"bio": "Doug Bieber has worked for companies ranging from software, health industry, computers and motorsports. He holds degrees from the University of Southern California and Cal Poly Pomona. Doug is Java Certified and lives in Southern California.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Yamaha Motor USA",
		"title": ""
	},
	{
		"_id": "54fdd20612b592030001d4fa",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2527770375-jpg/img/headshots/GautamAgrawal.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Gautam Agrawal",
		"bio": "Gautam Agrawal is the Director of Product Management for Sencha Frameworks and Tools. Prior to joining Sencha, he held various product and engineering positions at organizations developing SaaS and BI applications using Sencha technologies. He holds a PhD and MS from State University of NY (SUNY) at Buffalo.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Director, Product Management"
	},
	{
		"_id": "54fdd2030fc1100300fcf1d4",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689664-jpg/img/headshots/GrgurGrisogono.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Grgur Grisogono",
		"bio": "Grgur Grisogono is a Principal at Modus Create and the co-author of Ext JS in Action SE. As a software architect and trainer, Grgur shares his experience in JavaScript, CSS, HTML5, Sencha Touch, Ext JS, web apps and hybrid mobile with numerous Fortune 500 companies. Grgur is a long time member of the Sencha community, three-times European conference organizer, blogger and frequent meetup speaker.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Modus Create",
		"title": "Principal & Software Architect"
	},
	{
		"_id": "54fdd2030fc1100300fcf1d5",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2527770370-jpg/img/headshots/GaborPuhalla.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Gábor Puhalla",
		"bio": "Gábor Puhalla - Managing Director of profiq, delivering software engineering services from the Czech Republic to agile software houses in Silicon Valley. Specializes in management of highly skilled technical teams, QA and web security. Formerly held software engineering management positions at Oracle and Sun Microsystems. Co-founder and proud member of [pro]Test!, local test community in the Czech Republic and contributes to the international test community via International Software Testing Qualifications Board, reviewer of the Agile Tester - Foundation Level Extension Syllabus.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "profiq",
		"title": "Managing Director"
	},
	{
		"_id": "54fdd2050fc1100300fcf1de",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2537526315-jpg/img/headshots/JasonCline.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Jason Cline",
		"bio": "Jason Cline leads development of Sencha Space. Jason has spent most of his career on the bleeding edge of both mobile and web technologies. He led Sencha’s efforts to integrate Sencha Touch with our partners’ mobile APIs and was the SDK lead for Sencha’s Cloud efforts. Prior to Sencha, Jason spent 4 years working on the Dojo Toolkit helping to bring real time communication to pre-HTML5 browsers using XMPP and Comet. Before taking a leap to work on first generation JavaScript frameworks, he spent six years as a lead engineer at Vodafone building a scalable back-end for the early days of the mobile web.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Director of Engineering"
	},
	{
		"_id": "54fdd20312b592030001d4f1",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2561505622-jpg/img/headshots/JeanPhilippeEhret.jpg?t=1425695939615",
		"name": "Jean-Philippe Ehret",
		"bio": "Jean-Philippe Ehret is the COO at Jnesis, a company dedicated to the development of efficient business solutions integrating both Java and JavaScript. Jnesis' strong commitment to innovation in both technology and management have led to new solutions reducing dramatically the development costs of B to B applications, leading Jean-Philippe to expand its activity in nearby European countries and, naturally, towards a partnership with Sencha. Genuinely passionate about his work and cutting-edge technologies, Jean-Philippe also shares his expertise in open-source alternatives to Java EE architectures at one of France's leading school of software engineering, and acts as a trainer for professional developers in widely recognized training institutions.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Jnesis",
		"title": "Founder & COO"
	},
	{
		"_id": "54fdd2030fc1100300fcf1d3",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2547552335-jpg/img/headshots/JoshKeely.jpg?t=1425695939615",
		"name": "Josh Keely",
		"bio": "Josh Keely is a successful entrepreneur, and is currently Vice President of Product Development at Delta Health Technologies. Josh is responsible for overseeing the design, development, and overall product vision for all of Delta’s care-­at-­home software solutions. Josh launched his professional career in healthcare when he founded a successful SaaS business in 2003, which was later acquired by Delta. In his current role, Josh acts as an agile facilitator and mentor for the entire department, along with fulfilling the role of “product visionary” by designing and prototyping new products and innovations. Josh spends his spare time discovering new ways to improve existing processes, inventing and prototyping with his 3D printer, and working with several non­profit entities. ",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Delta Health Technologies",
		"title": "VP, Product Development"
	},
	{
		"_id": "550a8204a9a9ae03002e1307",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2630875665-jpg/img/headshots/KazuhiroKotsutsumi.jpg",
		"name": "Kazuhiro Kotsutsumi",
		"title": "President & CEO",
		"company": "Xenophy Co. Ltd",
		"bio": "Kazuhiro Kotsutsumi established Xenophy in March 2006. Since 2008, he has translated documentation of Ext JS APIs into Japanese, and published technical guide book on Ext JS for Japanese developers in 2011. He is the most known specialist for Sencha in Japanese market.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd20312b592030001d4f0",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562186-jpg/img/headshots/KollivakkamRaghaven.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Kollivakkam Raghavan",
		"bio": "Kollivakkam is a Principal Engineer at Cisco responsible for the architecture, design and delivery of the Management platform for Cisco’s Intercloud Fabric product. Kollivakkam has been using ExtJS for the last 5 years building network management platforms at F5 Networks, Mobileiron, Netapp, and Cisco. Kollivakkam enjoys building reusable components, and is passionate about great UX and architecture. Kollivakkam has spent a significant amount of time in performance tuning ExtJS grids and trees. In his current role, he is evangelizing agile methodologies and promoting practices such as TDD for Sencha based applications to ensure a high quality product.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Cisco",
		"title": "Principal Engineer"
	},
	{
		"_id": "54fdd2050fc1100300fcf1dd",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2520276467-jpg/img/headshots/LeeBoonstra.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Lee Boonstra",
		"bio": "Lee Boonstra is a sales engineer and technical trainer at Sencha in Europe. Lee lives in Amsterdam and has experience in both client-side and server-side development. She spends her spare time developing web and mobile apps. Also, she wrote a book for O'Reilly: Hands-on Sencha Touch 2.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Sales Engineer & Technical Writer"
	},
	{
		"_id": "551e36ea9f8dd30300848592",
		"avatar_url": "http://cdn2.hubspot.net/hubfs/439787/img/headshots/MarcGusmano.jpg?t=1428481721250",
		"name": "Marc Gusmano",
		"title": "Sales Engineer",
		"company": "Sencha",
		"bio": "Marc is a Sales Engineer with Sencha and has over 30 years of experience in the software services industry. He has been extensively involved with custom HTML5 browser and mobile development projects, using his experience to build HTML5 Single Page Applications. Marc has worked for several large software services companies, including Andersen Consulting and Hitachi Consulting, and he was co-owner of a software services and training company for over 10 years. Marc has a passion for building outstanding software, especially leading edge, user-centric applications.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd2050fc1100300fcf1dc",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2520276462-jpg/img/headshots/MarkBrocato.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Mark Brocato",
		"bio": "Before coming to Sencha, Mark was the Director for R+D for BioFortis, a Life Sciences startup, where he lead the development of several ExtJS applications. Mark is also the creator of mockaroo.com, a web service for generating large fake datasets for software testing and demos. Mark has been developing with ExtJS since version 2 and is currently working on the ExtJS plugin for JetBrains IDEs such as IntelliJ and WebStorm.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Senior Software Engineer"
	},
	{
		"_id": "54fdd20512b592030001d4f9",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562191-jpg/img/headshots/MarkLincoln.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Mark Lincoln",
		"bio": "After graduating from the University of Florida, Mark spent several years developing enterprise class applications using database languages like CA-Clipper, CA-Visual Objects, and Delphi. Once he discovered Web application development using ASP, ASP.NET, C#, and JavaScript, there was no turning back. He has been an avid user of ExtJS since its inception as an extension to the Yahoo UI framework (YUI-Ext). Mark resides in Arlington, VA where you can often find him out riding his bike, umpiring fast pitch softball, or coaching soccer when he is not developing leading edge solutions as a Senior Solutions Engineer for Sencha.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Senior Solutions Engineer"
	},
	{
		"_id": "551a57ef3ff9010300d563a0",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2672674340-jpg/img/headshots/BryntumMats.jpg?t=1427483970646",
		"name": "Mats Bryntse",
		"title": "Founder",
		"company": "Bryntum",
		"bio": "Mats Bryntse is the founder of Bryntum and co-creator of Siesta. He has been part of the Sencha community since 2007 and has created several Ext JS user extensions. In his spare time, Mats enjoys skiing and cursing over IE issues.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd20512b592030001d4f8",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2520382218-jpg/img/headshots/MaxRahder.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Max Rahder",
		"bio": "Max is a member of the Sencha Training team, with over 25 years of experience in web and mobile app development, JavaScript, Java and cloud computing. He lives in Madison, Wisconsin.​",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Senior Trainer"
	},
	{
		"_id": "54fdd2040fc1100300fcf1d9",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2537541365-jpg/img/headshots/MichaelFacemire.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Michael Facemire",
		"bio": "Michael serves Application Development & Delivery Professionals. He is a leading expert on mobile software development, software development process, and next-generation open web architectures. Michael has more than 13 years of experience in the software development industry. He joined Forrester from IBM, where he delivered industry-leading applications in mobile, social software, content management, portal, and workflow. While there, he authored or co-authored 23 patents in the areas of mobile software, collaborative systems, content management, and media services that have been issued or pending. Michael holds a bachelor's degree in computer engineering from Case Western Reserve University.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Forrester",
		"title": "Senior Analyst"
	},
	{
		"_id": "54f13706d1bcf203004dafa9",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2520276472-jpg/img/headshots/MiroBojic.jpg?t=1424529046577&t=1424796153192",
		"name": "Miroslav Bojic",
		"bio": "Miro has a dual background in Interaction Design and Computer Science. For the past three years at Sencha, he has worked primarily on designing developer tools, such as Sencha Architect, Animator as well as future Sencha tools, and he has a lot of experience with Ext JS Themes. Prior to Sencha, Miro worked as an interaction designer at Philips in the Netherlands. Miro has a doctorate degree in User System Interaction and is fluent in 3 languages (and conversational in an additional 3). When not designing, Miro enjoys riding his dutch bicycle (opafiets) in San Francisco.​",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Software Engineer and Interaction Designer "
	},
	{
		"_id": "54fdd2030fc1100300fcf1d2",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562196-jpg/img/headshots/MitchellJohnson.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Mitchell Johnson",
		"bio": "Mitchell leads all aspects of global technology service fulfillment for eVestment. He participates as a member of the senior management team in the governance processes of the organization's new product roadmap, architecture, telecommunications, networks, applications, media, and corporate IT infrastructure and oversees the execution of technology initiatives in support of the business goals and priorities set by the organization. Prior to joining eVestment, Mitchell held a variety of positions at Equifax in product management, mergers and acquisitions, and technology. As Vice President of Technology, Mitchell led a team that developed and maintained internet solutions for a global, business-to-consumer business unit. Prior to Equifax, Mitchell worked in various managerial and technical roles for the Enterprise Technology practice at Hitachi Consulting and Delta Air Lines. He has a range of Information Technology experience including architecture, strategy, development, operations and business-technology alignment. Mitchell holds a BA in Management Science and a certificate in Information Systems from the Georgia Institute of Technology and an MBA from Emory University, where he graduated Beta Gamma Sigma and received the faculty award for Organization and Management.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "eVestment",
		"title": "Chief Technology Officer"
	},
	{
		"_id": "54fdd20212b592030001d4ef",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2520276477-jpg/img/headshots/MitulBid.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Mitul Bid",
		"bio": "Mitul Bid has been working with Sencha technologies for over 5 years. A large part of his focus has been creating visually compelling user experiences. Mitul has been responsible for delivering large enterprise applications built using Sencha frameworks to several clients across the globe. Mitul graduated as a Computer Scientist from IIT Bombay and is the founder of Coditas, a company focussed on delivering solutions around the Sencha technologies.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Coditas",
		"title": "Co-founder & CEO"
	},
	{
		"_id": "550a81bd7922d4030005a07d",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2619286042-jpg/img/headshots/NaokiMashiko.jpg",
		"name": "Naoki Mashiko",
		"title": "Manager, Quality Management, Customer Services",
		"company": "NTT Communications Corporation",
		"bio": "Naoki Mashiko is a network engineer at OCN operated by NTT Communications, which is one of the largest ISPs in Japan. From 2002 to 2006, he engaged in development/operating Layer2 VPN NW (Transparent Lan Switching). Since 2006, he has been in charge of operating the backbone network and the peering points between the network and other ISPs.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd2020fc1100300fcf1d1",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2520276482-jpg/img/headshots/NaveenanMurugesu.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Naveenan Murugesu",
		"bio": "Naveenan is an Enterprise Solutions Manager with in the Developer Relations team at BlackBerry focusing on the web platform and technologies. Naveenan works closely with BlackBerry’s top enterprise partners and assist them to develop applications for the BlackBerry 10 platform as well cross platform applications. Naveenan’s expertise includes building applications using HTML, Java Script, WebWorks/Cordova and Sencha Touch.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "BlackBerry",
		"title": "Enterprise Solutions Manager"
	},
	{
		"_id": "54fdd20512b592030001d4f7",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2520276487-jpg/img/headshots/NickHarlow.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Nick Harlow",
		"bio": "Nick is a seasoned technology professional. He has served in both engineering and product management roles at a range of small and large software companies. Over the course of his career, he has specialized in enterprise search, identity and access management, security of networks, endpoints, and the cloud, and secure mobile application development. He was awarded a patent for innovations in digital signature technology for the web. In his role with Sencha, he leads product management and marketing efforts for Sencha Space, a leading web application management, deployment, and security platform. He holds a Bachelor of Science in Computer Science from Stanford University and an MBA from INSEAD.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Director, Product Management"
	},
	{
		"_id": "55013ec80deea20300d0d46e",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2579934021-jpg/img/headshots/NicolasMeunier.jpg?t=1426057845152",
		"name": "Nicolas Meunier",
		"title": "Senior Developer",
		"company": "KPMG",
		"bio": "With 15 years of experience in web development field, Nicolas is a full-stack JavaScript developer specialized in Ext JS and Node.js. He is passionate about web development and likes to share his knowledge on technologies including Ext JS, Node.js, .net (WCF), Web Services, PHP, and MySQL.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd20512b592030001d4f6",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2537541360-jpg/img/headshots/NigeWhite.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Nige White",
		"bio": "Nigel White has 20 years of experience in the IT industry. He has seen computer systems evolve from batch processing, back room behemoths that dictated user behavior into distributed, user-centered enablers of everyday tasks. Nigel has been working with rich Internet applications, and dynamic browser updating techniques since before the term \"Ajax\" was coined. Nigel currently works as a Senior Software Architect on the Ext JS development team.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Senior Software Architect"
	},
	{
		"_id": "551a584201026403007ead88",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2672256608-jpg/img/headshots/MorphisOwen.jpg?t=1427483970646",
		"name": "Owen Pagan",
		"title": "Founder",
		"company": "4Morphis",
		"bio": "Owen is one of the founders of 4Morphis. Based in Ireland, Owen started work as a programmer and web developer in 1998. After periods working as a management consultant and in corporate finance, he is now involved at management and board level in a number of high growth companies in the technology space including CoreHR, one of the UK’s and Irelands fastest growing HCM and payroll software companies.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd2020fc1100300fcf1d0",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689674-jpg/img/headshots/PatrickChu.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Patrick Chu",
		"bio": "Patrick Chu is currently a senior ExtJS Architect. In past, Patrick was employed as a technical trainer with Sencha teaching both the ExtJS and Sencha Touch classes. He has previously led the 1-day Sencha Touch Bootcamp at SenchaCon 2013, where he also gave two session talks. He has also spoken at Devlink and the Heartland Developer's Conference.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "",
		"title": "Ext JS Senior Architect"
	},
	{
		"_id": "54fdd2020fc1100300fcf1cf",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689679-jpg/img/headshots/PaulDelano.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Paul Delano",
		"bio": "Paul Delano is a hands-on software architect with many years of enterprise software development experience. He has 5 patents in the areas of computer aided design, artificial intelligence and collaborative search and has 2 pending in the areas of cloud computing and social analytics. Prior to FICO he has been the founding member of 4 technology companies and has built systems for companies like GE, Pfizer, Gartner Group and Lucent. He also teaches graduate level software courses at Fairfield University.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "FICO",
		"title": "Software Architect"
	},
	{
		"_id": "550a8158a9a9ae03002e1306",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2607373411-jpg/img/headshots/PeterDillinger.jpg",
		"name": "Peter Dillinger",
		"title": "Technical Manager in Static Analysis",
		"company": "Coverity",
		"bio": "Peter Dillinger is a Technical Manager in Static Analysis at Coverity by Synopsys, with more than five years of experience as a developer and technical lead in analysis of Java, C#, C++, and most recently, JavaScript code.  Peter was a top driving force and contributor to a four-year effort to consolidate three disparate static analysis engines into one engine, with a unified workflow and results of the highest quality.  He also designed and implemented some key technologies in Coverity’s web application security analysis. While earning his Ph.D. in Computer Science from Northeastern University and Master’s from Georgia Tech, Peter made published contributions to two ACM award-winning verification tools: ACL2 and the SPIN Model Checker. ",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd20212b592030001d4ee",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2560145452-jpg/img/headshots/PeterTierney.jpg?t=1425695939615",
		"name": "Peter Tierney",
		"bio": "Peter has nearly 20 years of experience in application development and management experience ranging from system architect to VP of Technology to team lead and mentor. He developed Flex/AIR applications for more than 8 years and found the conversion to Ext JS very complementary.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Williams",
		"title": "IT Analyst IV"
	},
	{
		"_id": "54fdd20412b592030001d4f5",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689684-jpg/img/headshots/PhilGuerrant.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Phil Guerrant",
		"bio": "Phil is a Senior Software Engineer at Sencha. He has spent over a decade of his life developing rich user interfaces on both mobile and desktop platforms. These days, Phil continues to enjoy his passion for web user interface as a core member of the Ext JS development team.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Senior Software Engineer"
	},
	{
		"_id": "551a57a43ff9010300d5639f",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2663067684-jpg/img/headshots/RevinGuillen.jpg?t=1427483970646",
		"name": "Revin Guillen",
		"title": "Senior Software Engineer",
		"company": "Sencha",
		"bio": "Revin Guillen leads development of the Sencha Space SDK, and has done so for a little over a year. Before coming to Sencha, Revin spent eight years specializing in JavaScript application architecture and framework development, building everything from individual widgets up to large enterprise web applications. He lives in the Seattle area, surviving on espresso and whatever's in the refrigerator.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54fdd20212b592030001d4ed",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689689-jpg/img/headshots/RobBoerman.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Rob Boerman",
		"bio": "Rob is the CTO of 2Gears. Rob has been working with Ext JS since before it was called that. 2Gears creates complex desktop and mobile applications for large international customers, using Ext JS, Sencha Touch, NodeJS and a large collection of other HTML5 technologies. At 2Gears we love mashing up frameworks and libraries to create cool stuff in records time with a high quality level.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "2Gears",
		"title": "CTO & Co-founder"
	},
	{
		"_id": "54fdd2040fc1100300fcf1db",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562206-jpg/img/headshots/RossGerbasi.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Ross Gerbasi",
		"bio": "Ross Gerbasi is a Senior Engineer at Sencha and is located in Chicago. Ross has been programming for over 15 years and has worked with Sencha Touch for over 3 years. He specializes in new and emerging media including video and graphics production and has contributed to the open source community on emerging interactive solutions. His work on Sencha and Cordova integration allow him to fuse his many skills into a single focus to provide app developers with tools to help simplify building mobile apps.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Senior Software Engineer"
	},
	{
		"_id": "54fdd2020fc1100300fcf1ce",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689694-jpg/img/headshots/ShikhirSingh.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Shikhir Singh",
		"bio": "Shikhir is a Senior Enterprise Solutions Manager at BlackBerry. He specializes in Enterprise Mobility, Cryptography, and cross platform app development. Prior to working at BlackBerry, Shikhir worked at Lockheed Martin and Sun Microsystems.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "BlackBerry",
		"title": "Senior Enterprise Solutions Manager"
	},
	{
		"_id": "54fdd2010fc1100300fcf1cd",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2522689699-jpg/img/headshots/SriHariGumpuMadan.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Sri Hari Gumpu Madan",
		"bio": "Currently working as a Leader Developer at Nielsen for four years, Sri Hari is part of the team responsible for the design, development and delivery of Answers On-Demand tool, a reporting platform for consumer data. Sri Hari’s skills include Java, JavaScript, Web services, Web applications, architecture. He holds a Master's degree in Engineering and enjoys rock music and traveling.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Nielsen",
		"title": "Lead Developer"
	},
	{
		"_id": "551a594701026403007ead8e",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2672256613-jpg/img/headshots/ModusStanB.jpg?t=1427483970646",
		"name": "Stan Bershadskiy  ",
		"title": "Senior Engineer",
		"company": "Modus Create",
		"bio": "Stan Bershadskiy is an engineer at Modus Create. Originally a Java developer for a large enterprise, Stan sought out a more close knit environment, joining Modus Create in 2012. Stan has worked with Sencha products since 2008, originally with Ext JS 2 and GXT. Stan likes to involve himself in anything browser related particularly around JavaScript and building rich web apps for both desktop and mobile. He is located in New York City and can be found presenting or spectating at the NYC JS Meetup sponsored by Modus Create.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0
	},
	{
		"_id": "54f13b4cf38c9b0300f66562",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562211-jpg/img/headshots/SteffenHiller.jpg?t=1424529046577&t=1424796153192",
		"name": "Steffen Hiller",
		"bio": "Steffen Hiller has been a loyal web developer since 1999. He likes to move pixels just as much as he likes to write code. While fighting here and there with plain PHP, HTML, JavaScript and CSS, his development experience took a major leap forward in 2007 when he started to work with two of today’s still leading web frameworks: Ruby on Rails and Ext JS. Since then he's enjoying Ruby and JavaScript on a daily basis. He has been working on numerous projects involving Ext JS and Sencha Touch. Steffen is working preferably close to the beach such as in Spain and Aruba, where he also tries to kitesurf as much as possible.",
		"twitter_handle": "steffenhiller",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Senior Solutions Engineer"
	},
	{
		"_id": "54fdd2010fc1100300fcf1cc",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562216-jpg/img/headshots/TimRiedel.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Tim Riedel",
		"bio": "Time Riedel is the CEO and founder of eyeworkers. He has been into web development for almost two decades, and is working with Sencha frameworks since its inception. Tim’s company, eyeworkers interactive GmbH, is a Sencha Select Partner and helps large companies in introducing web based solutions built on Sencha technologies. Tim has been instrumental in organizing everal Sencha related events across the globe.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "eyeworkers",
		"title": "CEO"
	},
	{
		"_id": "54fdd20112b592030001d4ec",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2520276497-jpg/img/headshots/VitaliyShevchuk.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Vitaliy Shevchuk",
		"bio": "Passionate about new technologies, with 18 years of IT experience, Vitaliy Shevchuk has for the last 10 years worked as the Java/Web Architecture Leader at BNP Paribas Securities Services. He is a Sun Certified Enterprise Architect since 2003 and the creator of ajaxAnywhere open source framework in 2005.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "BNP Paribas Securities Services",
		"title": "Lead Java/Web Architect"
	},
	{
		"_id": "54fdd2040fc1100300fcf1da",
		"avatar_url": "http://cdn2.hubspot.net/hub/439787/file-2511562221-jpg/img/headshots/VitalyKravchenko.jpg?t=1424529046577&amp;t=1425695939615",
		"name": "Vitaly Kravchenko",
		"bio": "Vitaly Kravchenko is the Graphics Engineer at Sencha. He was an independent developer of native desktop audio software, mobile games and web apps for 10 years before joining Sencha. Vitaly's serious dive into HTML5 happened in 2009 when he released WebOS's first stock market app. After that, he kissed native goodbye and never looked back.",
		"twitter_handle": "",
		"sessions": [],
		"__v": 0,
		"company": "Sencha",
		"title": "Graphics Engineer"
	}
]